Repository: wp-plugins/taxonomy-extra-tools
Catalog: languages/taxonomy-extra-tools-*.po
Languages: it_it

source: Taxonomy Extra Tools settings
it_it: Impostazioni Taxonomy Extra Tools

source: Advanced settings for custom Taxonomies and Post Types
it_it: Opzioni avanzate per tassonomie e tipi di post personalizzati

source: Enable Taxonomy Archive
it_it: Attiva Archivi Tassonomia

source: Enable Post Extra
it_it: Attiva Extra dei Post

source: Enable Title filter
it_it: Attiva riscrittura Titolo Post

source: Create your custom Post Types and Taxonomies using the plugin %s
it_it: Crea tassonomie e tipi di post personalizzati utilizzando il plugin %s

source: Add Images to Categories and Custom Taxonomies using the plugin %s
it_it: Aggiungi e associa immagini a categorie e tassonomie personalizzate utilizzando il plugin %s

source: Please select the Post Types you want to filter the title
it_it: Scegli i tipi di post di cui modificare il titolo

source: Please enter the separator between terms
it_it: Inserisci il separatore tra i termini di ogni tassonomia

source: (default: ", ")
it_it: (predefinito: ", ")

source: Please enter the structure of your custom title using placeholders
it_it: Inserisci la struttura personalizzata del titolo usando i segnaposto

source: Available placeholders:
it_it: Segnaposto disponibili:

source: Please select the Taxonomies you want to have a root archive page with a clean permalink
it_it: Scegli le tassonomie che avranno una pagina di archivio radice con un permalink pulito

source: Then you could style the output and replicate your post loop by adding a filter from your template/functions.php file,
it_it: Quindi puoi personalizzare lo stile del risultato visualizzato e replicare il loop dei post aggiungendo un filtro dal file functions.php del tema in uso

source: e.g.
it_it: ad es.

source: 3 is for the parameters: $output, $term_object, $taxonomy
it_it: dove 3 sta per i tre parametri passati: $output, $term_object, $taxonomy

source: The default Twenty Fourteen / Thirteen / Twelve themes are already supported.
it_it: Per i temi predefiniti Twenty Fourteen / Thirteen / Twelve è tutto già pronto.

source: You may need to further customize your template (archive.php, taxonomy.php, category.php, etc)
it_it: Potresti comunque aver bisogno di personalizzare ulteriormente i template (archive.php, taxonomy.php, category.php, etc)

source: Please select the Post Types you want to enable as Post related extras
it_it: Scegli i tipi di post che vuoi abilitare come extra associati ai post

source: No Available Post Types
it_it: Nessun tipo di post disponibile

source: --No Posts Created--
it_it: --Nessun Post creato--

source: --Select One--
it_it: --Scegli--

source: Permalink to %s
it_it: Link a %s

source: Your site&#8217;s most recent Extras.
it_it: Gli Extra più recenti.

source: Recent Extras
it_it: Extra

source: check if you want to display child terms in the root taxonomy archive / parent term pages
it_it: mostra i termini di livello inferiore nell'archivio principale della tassonomia o nel termine superiore

source: check if you want to hide child terms from the parent term page
it_it: nasconde i termini di livello inferiore dalla pagina del termine superiore

source: checking both the two settings above will enable a "flat view"
it_it: selezionando le due precedenti opzioni insieme si abilita una visualizzazione "piatta" dei termini

source: check if you want to display the posts of child terms in the parent term pages
it_it: mostra i post associati ai termini di livello inferiore nella pagina del termine superiore

source: check if you want to display posts in the root taxonomy archive / parent term pages
it_it: mostra tutti i post associati nell'archivio principale della tassonomia

source: (but why?? unexpected effects on pagination)
it_it: (ma perché mai? possibili controindicazioni sulla suddivisione in pagine)
